In [1]:
import pandas as pd
import os

In [3]:
# Arquivos na pasta Datasets
base = './../../Datasets/'
arquivos = [arquivo for arquivo in os.listdir(base)]

arquivos

['populacao_brasileira.csv',
 'german_credit_data.csv',
 'dataset_valores.txt',
 'diamonds.csv',
 'NAs.txt',
 '2010SitkaAK.csv',
 '2018WinterOlympics.csv',
 'Exercicio_Pandas_3.csv',
 'Iris.csv',
 'dataset_array.txt',
 '2010YumaAZ.csv',
 'bmw_pricing_challenge.csv',
 'heart.csv',
 'Exercicio_Pandas_2.json',
 'BankChurners.csv',
 '2010SantaBarbaraCA.csv',
 'dataset_valores_vazio.txt',
 'Exercicio_Pandas_1.csv',
 'dataset_desconfigurado.txt',
 'kc_house_data.csv',
 'cars.csv']

In [6]:
populacao = pd.read_csv(f'{base}/{arquivos[0]}', sep=';')
display(populacao.shape, populacao.head())

(37, 2)

   year  population
0  1980   119011052
1  1981   121154159
2  1982   123774229
3  1983   126403352
4  1984   129025577

In [8]:
credit = pd.read_csv(f'{base}/{arquivos[1]}')
display(arquivos[1], credit.shape, credit.head())

'german_credit_data.csv'

(1000, 10)

,Unnamed: 0,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,0,67,male,2,own,NaN,little,1169,6,radio/TV
1,1,22,female,2,own,little,moderate,5951,48,radio/TV
2,2,49,male,1,own,little,NaN,2096,12,education
3,3,45,male,2,free,little,little,7882,42,furniture/equipment
4,4,53,male,2,free,little,little,4870,24,car

In [10]:
valores = pd.read_fwf(f'{base}/{arquivos[2]}', widths=[8, 8, 8])
valores.columns = ['A', 'B', 'C']

display(arquivos[2], valores.shape, valores.head())

'dataset_valores.txt'

(5, 3)

        A       B       C
0  0.4839  0.4536  0.3561
1  0.1292  0.6875  0.6565
2  0.1781  0.3049  0.8928
3  0.7676  0.5801  0.2038
4  0.5993  0.4357  0.7410

In [15]:
# NAs
nas = pd.read_csv(f'{base}/{arquivos[4]}', sep='\t')
nas = nas.iloc[:,1:]
display(arquivos[4], nas.shape, nas.head())

'NAs.txt'

(10, 3)

          A         B         C
0 -0.166919  0.979728 -0.632955
1 -0.297953 -0.912674 -1.365463
2 -0.120211 -0.540679 -0.680481
3       NaN -2.027325  1.533582
4       NaN       NaN  0.461821

In [22]:
# Arquivos que começam com 2010 e são iguais
for arquivo in arquivos:
    if arquivo.startswith('2010'):
        df = pd.read_csv(f'{base}/{arquivo}')
        display(arquivo, df.shape, df.head())

'2010SitkaAK.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      10.5
1  20100601  TUESDAY     1:00      10.5
2  20100601  TUESDAY     2:00      10.0
3  20100601  TUESDAY     3:00       9.7
4  20100601  TUESDAY     4:00       9.4

'2010YumaAZ.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      25.2
1  20100601  TUESDAY     1:00      24.1
2  20100601  TUESDAY     2:00      24.4
3  20100601  TUESDAY     3:00      24.9
4  20100601  TUESDAY     4:00      22.8

'2010SantaBarbaraCA.csv'

(168, 4)

   LST_DATE      DAY LST_TIME  T_HR_AVG
0  20100601  TUESDAY     0:00      12.7
1  20100601  TUESDAY     1:00      12.7
2  20100601  TUESDAY     2:00      12.3
3  20100601  TUESDAY     3:00      12.5
4  20100601  TUESDAY     4:00      12.7

In [25]:
# Olympics
olympics = pd.read_csv(f'{base}/{arquivos[6]}')
display(arquivos[6], olympics.shape, olympics.head())

'2018WinterOlympics.csv'

(30, 6)

   Rank            NOC  Gold  Silver  Bronze  Total
0     1         Norway    14      14      11     39
1     2        Germany    14      10       7     31
2     3         Canada    11       8      10     29
3     4  United States     9       8       6     23
4     5    Netherlands     8       6       6     20

In [10]:
headers = ['     ', 'A       ', 'B    ', 'C']
widths = [len(head) for head in headers]

data = pd.read_fwf('./../../Datasets/dataset_array.txt', widths=widths, header=None)
data.columns = ['ID', 'A', 'B', 'C']
data.head()

    ID  A  B  C
0  1.0  0  0  0
1  2.0  0  0  0
2  3.0  0  0  0
3  4.0  0  0  0
4  5.0  0  0  0

In [20]:
data = pd.read_csv('./../../Datasets/diamonds.csv')
data.head()

,Unnamed: 0,carat,cut,color,clarity,depth,table,price,x,y,z
0,1,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43
1,2,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31
2,3,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31
3,4,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63
4,5,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75